---
kind: method
id: M:Autodesk.Revit.DB.LinePatternSegment.Dispose
source: html/6e14bdeb-6797-604f-6951-1629a0ef2858.htm
---
# Autodesk.Revit.DB.LinePatternSegment.Dispose Method

Releases all resources used by the LinePatternSegment

## Syntax (C#)
```csharp
public void Dispose()
```